In [1]:
j={"Product":{"0":"Desktop Computer","1":"Tablet","2":"iPhone","3":"Laptop"},"Price":{"0":700,"1":250,"2":800,"3":1200}}

In [2]:
j

{'Product': {'0': 'Desktop Computer',
  '1': 'Tablet',
  '2': 'iPhone',
  '3': 'Laptop'},
 'Price': {'0': 700, '1': 250, '2': 800, '3': 1200}}

In [4]:
import pandas as pd
df=pd.read_json('item.jason')

In [5]:
df

            Product  Price
0  Desktop Computer    700
1            Tablet    250
2            iPhone    800
3            Laptop   1200

In [6]:
js={"0":{"Product":"Desktop Computer","Price":700},"1":{"Product":"Tablet","Price":250},"2":{"Product":"iPhone","Price":800},"3":{"Product":"Laptop","Price":1200}}
df=pd.DataFrame(js)
df

                        0       1       2       3
Product  Desktop Computer  Tablet  iPhone  Laptop
Price                 700     250     800    1200

In [7]:
js=[["Desktop Computer",700],["Tablet",250],["iPhone",800],["Laptop",1200]]
df=pd.DataFrame(js)
df

                  0     1
0  Desktop Computer   700
1            Tablet   250
2            iPhone   800
3            Laptop  1200

**Methods to Round Values in Pandas DataFrame**

In [8]:
from pandas import DataFrame

Sample = {'Value': [5.52132,6.572935,7.21,8.755,9.9989]}
df = DataFrame(Sample, columns= ['Value'])

print(df)

      Value
0  5.521320
1  6.572935
2  7.210000
3  8.755000
4  9.998900

In [9]:
df['Value'].round(decimals=3)

0    5.521
1    6.573
2    7.210
3    8.755
4    9.999
Name: Value, dtype: float64

In [10]:
from pandas import DataFrame

Sample = {'Value': [5.52132,6.572935,7.21,8.755,9.9989]}
df = DataFrame(Sample, columns= ['Value'])

roundThree = df['Value'].round(decimals=3)
print(roundThree)

0    5.521
1    6.573
2    7.210
3    8.755
4    9.999
Name: Value, dtype: float64

In [11]:
from pandas import DataFrame
import numpy as np

Sample = {'Value': [5.52132,6.572935,7.21,8.755,9.9989]}
df = DataFrame(Sample, columns= ['Value'])

roundThree = np.round(df['Value'], decimals=3)
print(roundThree)

0    5.521
1    6.573
2    7.210
3    8.755
4    9.999
Name: Value, dtype: float64

In [12]:
from pandas import DataFrame
import numpy as np

Sample = {'Value': [5.52132,6.572935,7.21,8.755,9.9989]}
df = DataFrame(Sample, columns= ['Value'])

roundUp = df['Value'].apply(np.ceil) 
print (roundUp)

0     6.0
1     7.0
2     8.0
3     9.0
4    10.0
Name: Value, dtype: float64